WSM_I64B57/CFD/0/impParticleForces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      impParticleForces;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -2 0 0 0 0];

internalField   nonuniform List<vector> 
635
(
(4.84955e-05 -2.95047e-08 8.36367e-08)
(4.84599e-05 -2.98338e-08 8.57121e-08)
(4.83535e-05 -3.08177e-08 9.19194e-08)
(4.81778e-05 -3.24424e-08 1.02169e-07)
(4.78721e-05 -3.52651e-08 1.20085e-07)
(4.76787e-05 -3.70294e-08 1.32542e-07)
(4.75228e-05 -3.84269e-08 1.43805e-07)
(4.73476e-05 -3.99774e-08 1.57432e-07)
...
)
;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           uniform (4.85065e-05 -2.9403e-08 8.29949e-08);
    }
    wall_top
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    front1
    {
        type            cyclic;
    }
    back1
    {
        type            cyclic;
    }
    left1
    {
        type            cyclic;
    }
    right1
    {
        type            cyclic;
    }
    front2
    {
        type            cyclic;
    }
    back2
    {
        type            cyclic;
    }
    left2
    {
        type            cyclic;
    }
    right2
    {
        type            cyclic;
    }
    front3
    {
        type            cyclic;
    }
    back3
    {
        type            cyclic;
    }
    left3
    {
        type            cyclic;
    }
    right3
    {
        type            cyclic;
    }
}


// ************************************************************************* //
